# Pandas
- package built on top of NumPy 
- efficient implementation of dataframes

In [2]:
import pandas as pd

In [0]:
print(pd.__version__)
pd?

0.23.4

# Pandas Series
- 1D array of indexed data

## Creation of Pandas Series

In [0]:
series = pd.Series([0.2, 0.5, 0.75, 1.6])
print("Pandas Series:\n" , series)

#Attributes of pandas Series
print("Series.values: ",series.values)
print("Data type of Series: ", type(series.values))
print("Type of series: ", type(series))
print("Index of Series: ", series.index)

Pandas Series:
 0    0.20
1    0.50
2    0.75
3    1.60
dtype: float64
Series.values:  [0.2  0.5  0.75 1.6 ]
Data type of Series:  <class 'numpy.ndarray'>
Type of series:  <class 'pandas.core.series.Series'>
Index of Series:  RangeIndex(start=0, stop=4, step=1)

In [0]:
pd.Series(5, index=[100, 200, 300])

100    5
200    5
300    5
dtype: int64

### Creating series from a list

In [0]:
List=[20, 15, 42, 33, 94, 8, 5]
print("List is: " , List)
ser_list=pd.Series(List)
print("Series from List: \n",ser_list)

List is:  [20, 15, 42, 33, 94, 8, 5]
Series from List:
 0    20
1    15
2    42
3    33
4    94
5     8
6     5
dtype: int64

In [0]:
print("Explicit Indexing: \n",
      pd.Series(List, index = ['i','ii','iii','iv','v','vi','vii']))

Explicit Indexing:
  i      20
ii     15
iii    42
iv     33
v      94
vi      8
vii     5
dtype: int64

In [0]:
order=[1,2,3,4,5,6,7]
ser_ord=pd.Series(List,index=order)
print("Ordered series: \n",ser_ord)

Ordered series:
 1    20
2    15
3    42
4    33
5    94
6     8
7     5
dtype: int64

##### Numpy 1D array vs Series
- Array contains implicit indexing, series has explicit indexing along with some additional capabilities

In [20]:
import numpy as np

In [0]:
#Creating Series from a Ndarray

np_arr=np.random.rand(5)
print("Array is: ", np_arr)

index=['a','b','c','d','e']
ser_arr=pd.Series(np_arr,index=index)
print("Series from Numpy Array: \n", ser_arr)

Array is:  [0.18476214 0.76652344 0.85011595 0.84014284 0.04422941]
Series from Numpy Array:
 a    0.184762
b    0.766523
c    0.850116
d    0.840143
e    0.044229
dtype: float64

##### Pandas Series are a kind of specialization of Python dictionaries.
- A dictionary is a structure that maps arbitrary keys to a set of arbitrary values, and a Series is a structure that maps typed keys to a set of typed values.
- But series are much more effecient than dictionaries

In [7]:
#creating series from a dictionary
d={'monkey':153 ,'rat':212 ,'cotton':334 ,'fan':98}
print("Dictionary is: ", d)
ser_d=pd.Series(d)
print("Series from Dictionary:\n", ser_d)

Dictionary is:  {'monkey': 153, 'rat': 212, 'cotton': 334, 'fan': 98}
Series from Dictionary:
 monkey    153
rat       212
cotton    334
fan        98
dtype: int64

# Indexing and slicing

In [ ]:
# Index as immutable array

ind = pd.Index([2, 3, 5, 7, 11])
print(ind)
print(ind[2])
print(ind[ : : 2])
# familiar attributes from NumPy arrays
print(ind.size , ind.shape, ind.ndim, ind.dtype)
#ind[2] = 4

In [3]:
pd.Series({2:'a', 1:'b', 3:'c'}, index=[3, 2])

3    c
2    a
dtype: object

In [4]:
s1= pd.Series([0,1,2,3,4])
print(s1)
s1.index=['A','B','C','D','E']
print(s1)

0    0
1    1
2    2
3    3
4    4
dtype: int64
A    0
B    1
C    2
D    3
E    4
dtype: int64

In [16]:
print('A' in s1)
print(s1.keys())
print(list(s1.items()))

# extending the series like dictinaries
s1['F'] = 5
print(s1)

True
Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')
[('A', 0), ('B', 1), ('C', 2), ('D', 3), ('E', 4), ('F', 5)]
A    0
B    1
C    2
D    3
E    4
F    5
dtype: int64

## Index Slicing
- Explicit 
- Implicit

In [ ]:
print(ser_d['monkey' : 'cotton'])

In [ ]:
d = pd.Series(['a', 'b', 'c'], index=[1, 3, 5])
print("Series : \n",d)
print('d[1]' , d[1])
print('d[1:3]' , d[1:3])

In [21]:
d1 = pd.Series([1,2,3,4,5], index = [0,1,2,3,4])
print('Series : \n' , d1)
print('d1[0:3] ' , d1[0:3])

0    1
1    2
2    3
3    4
4    5
dtype: int64
0    1
1    2
2    3
dtype: int64

In [11]:
print("Series is : \n",s1)
# For explicit slicing, the stop index is inclusive 
print("Explicit Slicing")
print('s1['A' : 'E'] ' , s1['A' : 'E'])
print('s1[:'D'] ' , s1[:'D'])
print("Implicit Slicing")
print('s1[0 : 4] ' , s1[0 : 4])
print('s1[-2:] ' , s1[-2:])

# Masking
print("Masking : s1[(s1>0) & (s1<4)] ", s1[(s1>0) & (s1<4)])

# Fancy indexing
print('s1[['A', 'C']] ' , s1[['A', 'C']])

A    0
B    1
C    2
D    3
E    4
dtype: int64
A    0
B    1
C    2
D    3
dtype: int64
B    1
C    2
D    3
dtype: int64
A    0
C    2
dtype: int64
0    9
1    8
2    6
3    5
4    4
dtype: int64
0    9
1    8
2    6
3    5
4    4
dtype: int64

In [14]:
#the loc - indexing and slicing with explicit index
print('Seies: \n' , d)
print('d.loc[1:3] ' , d.loc[1:3])
print('d.loc[1] ' , d.loc[1])

1    a
3    b
5    c
dtype: object
1    a
3    b
dtype: object
a

In [16]:
#iloc - indexing and slicing with implicit index:
print('Seies: \n' , d)
print('d.iloc[1] ' , d.iloc[1])
print('d.iloc[1 : 3] ', d.iloc[1 : 3])

1    a
3    b
5    c
dtype: object
b
3    b
5    c
dtype: object

## Series Operations

In [0]:
s3 = pd.Series([1,2,3,4], index = ['a','b','c','d'])
print(s3)
s4=s1.append(s3)
print(s4)
print(type(s4))

a    1
b    2
c    3
d    4
dtype: int64
A    0
B    1
C    2
D    3
E    4
a    1
b    2
c    3
d    4
dtype: int64
<class 'pandas.core.series.Series'>

In [0]:
# Delete a row with a particular element
s4.drop('c')

A    0
B    1
C    2
D    3
E    4
a    1
b    2
d    4
dtype: int64

### Arithmetic Functions

In [20]:
s5=pd.Series([6,7,8,9,5])
s6=pd.Series([0,1,2,3,4,5,7])
print('Series are : \n',s5, '\n', s6)

Series are :
 0    6
1    7
2    8
3    9
4    5
dtype: int64
 0    0
1    1
2    2
3    3
4    4
5    5
6    7
dtype: int64

In [22]:
print('Addition of series: \n', s5.add(s6))
print('\n Subtraction of series: \n', s5.sub(s6))
print('\n Multiplication of series: \n', s5.mul(s6))
print('\n Division of series: \n', s5.div(s6))

Addition of series:
 0     6.0
1     8.0
2    10.0
3    12.0
4     9.0
5     NaN
6     NaN
dtype: float64

 Subtraction of series:
 0    6.0
1    6.0
2    6.0
3    6.0
4    1.0
5    NaN
6    NaN
dtype: float64

 Multiplication of series:
 0     0.0
1     7.0
2    16.0
3    27.0
4    20.0
5     NaN
6     NaN
dtype: float64

 Division of series:
 0         inf
1    7.000000
2    4.000000
3    3.000000
4    1.250000
5         NaN
6         NaN
dtype: float64

### Aggregate Functions
- helps in knowing the missing values in big data sets

In [24]:
print("Median of series: \n",s6, 'is- ', s6.median())
print("Mean of series: \n",s6, 'is- ', s6.mean())
print("Maximum of series: \n",s5, 'is- ', s6.max())
print("Minimum of series: \n",s5, 'is- ', s6.min())

Median of series:
 0    0
1    1
2    2
3    3
4    4
5    5
6    7
dtype: int64 is-  3.0
Mean of series:
 0    0
1    1
2    2
3    3
4    4
5    5
6    7
dtype: int64 is-  3.142857142857143
Maximum of series:
 0    6
1    7
2    8
3    9
4    5
dtype: int64 is-  7
Minimum of series:
 0    6
1    7
2    8
3    9
4    5
dtype: int64 is-  0

### DataFrames
- generalization of NumPy 2D Arrays 
- multidimensional arrays with attached row and column lables
- can be seen as a sequence of aligned Series object, i.e., share same index
- with heterogenous and/or missing data
- no. of powerful data operations
- data munging tasks

In [3]:
data = [{'a': i, 'b': 2 * i} for i in range(3)] 
pd.DataFrame(data)

   a  b
0  0  0
1  1  2
2  2  4

In [9]:
pd.DataFrame([{'a': 1, 'b': 2}, {'b': 3, 'c': 4}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

In [33]:
population_d = {'California': 3833, 'Texas': 8193, 'New York': 6511, 'Florida': 5560, 'Ohio': 1135}  
population = pd.Series(population_d)
print(population)

California    3833
Texas         8193
New York      6511
Florida       5560
Ohio          1135
dtype: int64

In [34]:
area_d = {'California': 423967, 'Texas': 695662, 'New York': 141297,   
             'Florida': 170312, 'Ohio': 149995}
area = pd.Series(area_d) 
print(area)

California    423967
Texas         695662
New York      141297
Florida       170312
Ohio          149995
dtype: int64

In [35]:
states = pd.DataFrame({'population': population,  'area': area})
print(states)
print('\n', states.index)
print('\n', states.columns)
print(states['area'])
print(states.area)
print(states.area is states['area'])

            population    area
California        3833  423967
Texas             8193  695662
New York          6511  141297
Florida           5560  170312
Ohio              1135  149995

 Index(['California', 'Texas', 'New York', 'Florida', 'Ohio'], dtype='object')

 Index(['population', 'area'], dtype='object')
California    423967
Texas         695662
New York      141297
Florida       170312
Ohio          149995
Name: area, dtype: int64
California    423967
Texas         695662
New York      141297
Florida       170312
Ohio          149995
Name: area, dtype: int64
True

In [2]:
num_arr = np.random.randn(6,4) #Import numpy random arrays
num_arr

array([[-0.68275101,  1.2364251 ,  1.718707  ,  1.09286882],
       [ 2.2887263 , -0.18756687,  0.1449395 , -1.57203608],
       [-1.52607439,  0.84389585,  1.76900056, -0.01454395],
       [-0.24141241,  1.03873608,  0.13135728,  1.40423229],
       [-1.24861485,  0.09461122, -0.77540976,  0.91738519],
       [-0.5155085 ,  0.3374779 ,  1.73147745,  0.75360304]])

In [5]:
columns=['A','B','C','D']
df1=pd.DataFrame(num_arr,columns=columns)
df1

          A         B         C         D
0 -0.682751  1.236425  1.718707  1.092869
1  2.288726 -0.187567  0.144940 -1.572036
2 -1.526074  0.843896  1.769001 -0.014544
3 -0.241412  1.038736  0.131357  1.404232
4 -1.248615  0.094611 -0.775410  0.917385
5 -0.515508  0.337478  1.731477  0.753603

##### DataFrame as a specialized Dictionary  
- DataFrame maps a column name to a Series of column data.

In [40]:
print(states)
print(states['area'])

            population    area
California        3833  423967
Texas             8193  695662
New York          6511  141297
Florida           5560  170312
Ohio              1135  149995
California    423967
Texas         695662
New York      141297
Florida       170312
Ohio          149995
Name: area, dtype: int64

In [41]:
data = [{'a': i, 'b': 2 * i} 
        for i in range(3)]
pd.DataFrame(data)

   a  b
0  0  0
1  1  2
2  2  4

In [42]:
pd.DataFrame([{'a': 1, 'b': 2}, {'b': 3, 'c': 4}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

## Handling missing data

In [45]:
vals1 = np.array([1, None, 3, 4])      
print(vals1)
print(vals1.sum())

[1 None 3 4]

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

### NaN: Missing numerical data

In [47]:
#NaN is a bit like a data virusâ€”it infects any other object it touches.
print(1 + np.nan)
print(0 *  np.nan)

nan
nan

In [46]:
vals2 = np.array([1, np.nan, 3, 4])
vals2.dtype

dtype('float64')

In [49]:
print(vals2.sum(), vals2.min(), vals2.max())
print(np.nansum(vals2) ,np.nanmin(vals2), np.nanmax(vals2))

nan nan nan
8.0 1.0 4.0

### NaN and None in Pandas

In [50]:
print(pd.Series([1, np.nan, 2, None]))
ser_null = pd.Series(range(2), dtype=int)
print(ser_null)
ser_null[0] = None 
print(ser_null)
#casting the integer array to floating point, Pandas automatically converts the None to a NaN value.

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64
0    0
1    1
dtype: int32
0    NaN
1    1.0
dtype: float64

In [52]:
#Detecting null values
data = pd.Series([1, np.nan, 'hello', None])
print(data)
print(data.isnull())
print(data[data.notnull()])

0        1
1      NaN
2    hello
3     None
dtype: object
0    False
1     True
2    False
3     True
dtype: bool
0        1
2    hello
dtype: object

In [53]:
#Dropping null values
print(data.dropna())

0        1
2    hello
dtype: object

     0    1  2   3
1  2.0  3.0  5 NaN

- This might drop good data, then we specify how or thresh parameters
- For finer-grained control, the thresh parameter specifies a min no. of non-null values for the row/column to be kept

In [ ]:
df.dropna(axis='rows', thresh=3)

In [60]:
df = pd.DataFrame([[1,      np.nan, 2],    
                   [2,      3,      5],     
                   [np.nan, 4,      6]])  
print(df)
print(df.dropna())
print(df.dropna(axis='columns'))
df.dropna(axis='rows', thresh=3)

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6
     0    1  2
1  2.0  3.0  5
   2
0  2
1  5
2  6

     0    1  2
1  2.0  3.0  5

In [58]:
df[3] = np.nan
print(df)
df.dropna(axis='columns', how='all')

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [63]:
# Filling null values
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))   
print(data)
print(data.fillna(0))
print(data.fillna(method='ffill'))
print(data.fillna(method='bfill'))

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64
a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64
a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64
a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [64]:
print(df)
print(df.fillna(method='ffill', axis=1))

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6
     0    1    2
0  1.0  1.0  2.0
1  2.0  3.0  5.0
2  NaN  4.0  6.0

In [21]:
#Create dataframe with dictionary
data={'animals':['cat','cat','turtle','dog','dog','cat','turtle','cat','dog','dog'],
           'age':[2.5,3,0.5,np.nan,5,2,4.5,np.nan,7,3], 
           'visits':[1,3,2,3,2,3,1,1,2,1], 
           'priority':['y','y','n','y','n','n','n','y','n','n']}
labels=['a','b','c','d','e','f','g','h','i','j']
df2=pd.DataFrame(data,index=labels)
df2

  animals  age  visits priority
a     cat  2.5       1        y
b     cat  3.0       3        y
c  turtle  0.5       2        n
d     dog  NaN       3        y
e     dog  5.0       2        n
f     cat  2.0       3        n
g  turtle  4.5       1        n
h     cat  NaN       1        y
i     dog  7.0       2        n
j     dog  3.0       1        n

In [26]:
df2.ix[:5, 'animals':'visits']

E:\Anaconda\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

  animals  age  visits
a     cat  2.5       1
b     cat  3.0       3
c  turtle  0.5       2
d     dog  NaN       3
e     dog  5.0       2

In [0]:
#Datatypes of array
df2.dtypes

animals      object
age         float64
visits        int64
priority     object
dtype: object

In [0]:
df2.head()

df3=df2.head(6)
df3

df2.tail(3)

  animals  age  visits priority
a     cat  2.5       1        y
b     cat  3.0       3        y
c   snake  0.5       2        n
d     dog  NaN       3        y
e     dog  5.0       2        n

In [0]:
df2.index 

df2.columns

df2.values #just an easy way to convert this all into a numpy array

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'], dtype='object')

In [25]:
df2.describe() #statistical data of dataframe
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, ECE to CS
Data columns (total 1 columns):
F_name    5 non-null object
dtypes: object(1)
memory usage: 240.0+ bytes

In [0]:
df2.T #Transpose

            a    b      c    d    e    f      g    h    i    j
animals   cat  cat  snake  dog  dog  cat  snake  cat  dog  dog
age       2.5    3    0.5  NaN    5    2    4.5  NaN    7    3
visits      1    3      2    3    2    3      1    1    2    1
priority    y    y      n    y    n    n      n    y    n    n

In [68]:
#print(df2.sort_values())
print(df2.sort_values(by='age')) #default is ascending

  animals  age  visits priority
c   snake  0.5       2        n
f     cat  2.0       3        n
a     cat  2.5       1        y
b     cat  3.0       3        y
j     dog  3.0       1        n
g   snake  4.5       1        n
e     dog  5.0       2        n
i     dog  7.0       2        n
d     dog  NaN       3        y
h     cat  NaN       1        y

In [0]:
df2.sort_values(by='age')[1:4] # combining sorting and slicing

  animals  age  visits priority
f     cat  2.0       3        n
a     cat  2.5       1        y
b     cat  3.0       3        y

In [0]:
df2[['age','visits']] #selecting particular columns

   age  visits
a  2.5       1
b  3.0       3
c  0.5       2
d  NaN       3
e  5.0       2
f  2.0       3
g  4.5       1
h  NaN       1
i  7.0       2
j  3.0       1

In [70]:
df3=df2.copy()
df3

  animals  age  visits priority
a     cat  2.5       1        y
b     cat  3.0       3        y
c   snake  0.5       2        n
d     dog  NaN       3        y
e     dog  5.0       2        n
f     cat  2.0       3        n
g   snake  4.5       1        n
h     cat  NaN       1        y
i     dog  7.0       2        n
j     dog  3.0       1        n

In [0]:
df3.isnull() # returns true wherever values are null

   animals    age  visits  priority
a    False  False   False     False
b    False  False   False     False
c    False  False   False     False
d    False   True   False     False
e    False  False   False     False
f    False  False   False     False
g    False  False   False     False
h    False   True   False     False
i    False  False   False     False
j    False  False   False     False

In [0]:
df3.loc['f','age']=1.5 #changing particular value in the same dataframe
df3

  animals  age  visits priority
a     cat  2.5       1        y
b     cat  3.0       3        y
c   snake  0.5       2        n
d     dog  NaN       3        y
e     dog  5.0       2        n
f     cat  1.5       3        n
g   snake  4.5       1        n
h     cat  NaN       1        y
i     dog  7.0       2        n
j     dog  3.0       1        n

In [0]:
df3.mean()

df3[['age']].mean()

df3[['visits']].sum()

df3[['visits']].max()

df3[['visits']].min()

df3.sum()

age       3.375
visits    1.900
dtype: float64

In [0]:
string=pd.Series(['a','b','c','S','e','J','g','B','P','o'])
string

string.str.upper()

string.str.lower()

0    a
1    b
2    c
3    S
4    e
5    J
6    g
7    B
8    P
9    o
dtype: object

#Operations of data frames for missing values

In [73]:
print(df3)
df4=df3.copy()
print(df4.fillna(4)) #fill Nan with 4

  animals  age  visits priority
a     cat  2.5       1        y
b     cat  3.0       3        y
c   snake  0.5       2        n
d     dog  NaN       3        y
e     dog  5.0       2        n
f     cat  2.0       3        n
g   snake  4.5       1        n
h     cat  NaN       1        y
i     dog  7.0       2        n
j     dog  3.0       1        n
  animals  age  visits priority
a     cat  2.5       1        y
b     cat  3.0       3        y
c   snake  0.5       2        n
d     dog  4.0       3        y
e     dog  5.0       2        n
f     cat  2.0       3        n
g   snake  4.5       1        n
h     cat  4.0       1        y
i     dog  7.0       2        n
j     dog  3.0       1        n

In [75]:
meanage=df4['age'].mean()
meanage

3.4375

In [76]:
df4.fillna(meanage)

  animals     age  visits priority
a     cat  2.5000       1        y
b     cat  3.0000       3        y
c   snake  0.5000       2        n
d     dog  3.4375       3        y
e     dog  5.0000       2        n
f     cat  2.0000       3        n
g   snake  4.5000       1        n
h     cat  3.4375       1        y
i     dog  7.0000       2        n
j     dog  3.0000       1        n

In [0]:
#Dropping data
df5=df3.copy()
df5=df5.dropna(how='any')
df5

  animals  age  visits priority
a     cat  2.5       1        y
b     cat  3.0       3        y
c   snake  0.5       2        n
e     dog  5.0       2        n
f     cat  1.5       3        n
g   snake  4.5       1        n
i     dog  7.0       2        n
j     dog  3.0       1        n

## Filling up missing data

In [77]:
df3.to_csv('animal.csv')

In [0]:
df_animal=pd.read_csv('animal.csv')
df_animal.head(3)

  Unnamed: 0 animals  age  visits priority
0          a     cat  2.5       1        y
1          b     cat  3.0       3        y
2          c   snake  0.5       2        n

In [79]:
df3.to_excel('animal.xlsx',sheet_name='sheet1')
df_animal2=pd.read_excel('animal.xlsx', 'sheet1',
                         index_col=None, na_values=['NA'])
df_animal2

  Unnamed: 0 animals  age  visits priority
0          a     cat  2.5       1        y
1          b     cat  3.0       3        y
2          c   snake  0.5       2        n
3          d     dog  NaN       3        y
4          e     dog  5.0       2        n
5          f     cat  2.0       3        n
6          g   snake  4.5       1        n
7          h     cat  NaN       1        y
8          i     dog  7.0       2        n
9          j     dog  3.0       1        n

In [18]:
# Index as immutable array

ind = pd.Index([2, 3, 5, 7, 11])
print(ind)
print(ind[2])
print(ind[ : : 2])
# familiar attributes from NumPy arrays
print(ind.size , ind.shape, ind.ndim, ind.dtype)
#ind[2] = 4

Int64Index([2, 3, 5, 7, 11], dtype='int64')
5
Int64Index([2, 5, 11], dtype='int64')
5 (5,) 1 int64

TypeError: Index does not support mutable operations

In [ ]:
# Index object vs array
ind[1] = 0

In [11]:
# Index as ordered set
indA = pd.Index([1, 3, 5, 7, 9])
indB = pd.Index([2, 3, 5, 7, 11])

print(indA & indB) # intersection
print(indA | indB) # union
print(indA ^ indB) # symmetric difference

Int64Index([3, 5, 7], dtype='int64')
Int64Index([1, 2, 3, 5, 7, 9, 11], dtype='int64')
Int64Index([1, 2, 9, 11], dtype='int64')

## Combining Datasets
- Pandas concatenation preserves indices, even if it results in duplicate indices.

##### Series Concatenation

In [2]:
ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3]) 
ser2 = pd.Series( ['D', 'E', 'F'], index=[4, 5, 6] ) 
print("Series 1 : \n",ser1, "\nSeries 2 : \n",ser2)
print("Concatenating series: \n", pd.concat([ser1, ser2]))

Series 1 :
 1    A
2    B
3    C
dtype: object
Series 2 :
 4    D
5    E
6    F
dtype: object
Concatenating series:
 1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

###### Data Frame Concatenation

In [3]:
df1 = pd.DataFrame({'A' : ['axe', 'apple', 'ant'], 'B' : ['bat', 'bomb', 'brain'], 'C' : ['cap', 'cape', 'curtain']}, index = [1,2,3])
df2 = pd.DataFrame({'D' : ['drain', 'drape', 'dot'], 'E': [ 'eagle', 'elephant', 'egg'], 'F': ['fan', 'frame', 'flag']}, index =[ 2, 3, 6])
print("Data frame 1 : \n", df1,'\n Data Frame 2: \n', df2)
print("Concatenating Data Frames: \n",pd.concat([df1,df2]))
print("Concatenating Data Frames along axis 1: \n",pd.concat([df1,df2], axis = 1))

Data frame 1 :
        A      B        C
1    axe    bat      cap
2  apple   bomb     cape
3    ant  brain  curtain
 Data Frame 2:
        D         E      F
2  drain     eagle    fan
3  drape  elephant  frame
6    dot       egg   flag
Concatenating Data Frames:
        A      B        C      D         E      F
1    axe    bat      cap    NaN       NaN    NaN
2  apple   bomb     cape    NaN       NaN    NaN
3    ant  brain  curtain    NaN       NaN    NaN
2    NaN    NaN      NaN  drain     eagle    fan
3    NaN    NaN      NaN  drape  elephant  frame
6    NaN    NaN      NaN    dot       egg   flag
Concatenating Data Frames along axis 1:
        A      B        C      D         E      F
1    axe    bat      cap    NaN       NaN    NaN
2  apple   bomb     cape  drain     eagle    fan
3    ant  brain  curtain  drape  elephant  frame
6    NaN    NaN      NaN    dot       egg   flag

C:\Users\User\Anaconda3\lib\site-packages\ipykernel_launcher.py:4: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  after removing the cwd from sys.path.

##### Ignoring the index

In [4]:
df_concat = pd.concat([df1, df2], ignore_index = True)
print("Concatenation of dataframes while ignoring the index: \n", df_concat)

Concatenation of dataframes while ignoring the index:
        A      B        C      D         E      F
0    axe    bat      cap    NaN       NaN    NaN
1  apple   bomb     cape    NaN       NaN    NaN
2    ant  brain  curtain    NaN       NaN    NaN
3    NaN    NaN      NaN  drain     eagle    fan
4    NaN    NaN      NaN  drape  elephant  frame
5    NaN    NaN      NaN    dot       egg   flag

C:\Users\User\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

##### Joining Data Frames

In [5]:
df3 = pd.DataFrame({'B' : ['ball', 'box' , 'band'], 'C': ['cat', 'calendar', 'cone'],'G' : ['grain', 'grape', 'goat']} , index =[ 1, 4, 2])
print("Data Frame 1 : \n", df1, "Data Frame 3 : \n", df3)
print(" Joining Data frmes:  \n" , pd.concat([df1, df3]))
print(" Joining Data frmes along axis = 1:  \n" , pd.concat([df1, df3], axis = 1))

Data Frame 1 :
        A      B        C
1    axe    bat      cap
2  apple   bomb     cape
3    ant  brain  curtain Data Frame 3 :
       B         C      G
1  ball       cat  grain
4   box  calendar  grape
2  band      cone   goat
 Joining Data frmes:
        A      B         C      G
1    axe    bat       cap    NaN
2  apple   bomb      cape    NaN
3    ant  brain   curtain    NaN
1    NaN   ball       cat  grain
4    NaN    box  calendar  grape
2    NaN   band      cone   goat
 Joining Data frmes along axis = 1:
        A      B        C     B         C      G
1    axe    bat      cap  ball       cat  grain
2  apple   bomb     cape  band      cone   goat
3    ant  brain  curtain   NaN       NaN    NaN
4    NaN    NaN      NaN   box  calendar  grape

C:\Users\User\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  This is separate from the ipykernel package so we can avoid doing imports until

In [6]:
print(" Inner Join on dataframes : \n", pd.concat([df1, df3], join = 'inner'))

 Inner Join on dataframes :
        B         C
1    bat       cap
2   bomb      cape
3  brain   curtain
1   ball       cat
4    box  calendar
2   band      cone

In [7]:
print(pd.concat([df1, df3], join_axes = [df1.columns]))

       A      B         C
1    axe    bat       cap
2  apple   bomb      cape
3    ant  brain   curtain
1    NaN   ball       cat
4    NaN    box  calendar
2    NaN   band      cone

##### using append() function
- the append() method in Pandas does not modify the original objectâ€”instead, it creates a new object with the combined data
- not very efficient method as a new index and data buffer is created

In [8]:
print(df1)
print(df2)
df1.append(df2)

       A      B        C
1    axe    bat      cap
2  apple   bomb     cape
3    ant  brain  curtain
       D         E      F
2  drain     eagle    fan
3  drape  elephant  frame
6    dot       egg   flag

C:\Users\User\Anaconda3\lib\site-packages\pandas\core\frame.py:6211: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort)

       A      B        C      D         E      F
1    axe    bat      cap    NaN       NaN    NaN
2  apple   bomb     cape    NaN       NaN    NaN
3    ant  brain  curtain    NaN       NaN    NaN
2    NaN    NaN      NaN  drain     eagle    fan
3    NaN    NaN      NaN  drape  elephant  frame
6    NaN    NaN      NaN    dot       egg   flag

##### Merge Operations

##### One-to-one join
- uses a common column as the key to join the dataframe.
- the order of values in each column in not necessarily maintained

In [10]:
df_stud = pd.DataFrame({'St_id': [101,102,103,104,105],'Branch': ['IT','CS','ECE','CS','Mech']})
df_fac = pd.DataFrame({'F_id' : [110,120,130,140,150 ],'F_name' : ['A', 'B', 'C', 'D', 'E'],'Branch': ['ECE','Mech', 'EEE', "IT", 'CS'] })
print("Student dataframe: \n", df_stud,'\nFaculty Dataframe :\n', df_fac)
df_merge = pd.merge(df_stud, df_fac)
print("Merged dataframe : \n ", df_merge)

Student dataframe:
    St_id Branch
0    101     IT
1    102     CS
2    103    ECE
3    104     CS
4    105   Mech
Faculty Dataframe :
    F_id F_name Branch
0   110      A    ECE
1   120      B   Mech
2   130      C    EEE
3   140      D     IT
4   150      E     CS
Merged dataframe :
     St_id Branch  F_id F_name
0    101     IT   140      D
1    102     CS   150      E
2    104     CS   150      E
3    103    ECE   110      A
4    105   Mech   120      B

##### Many-to-one joins
- one of the two key columns contains duplicate entries.
- the merged DataFrame preserves the duplicate entries.

In [8]:
df_faculty = pd.DataFrame({'F_name': ['A','C','B', 'E', 'H'],'F_field': ['AI', 'BS', 'DLD','thermo','DS']})
print("Faculty information : \n", df_faculty, "\n\nMerged DF: \n", df_merge)
print('\n',pd.merge(df_merge, df_faculty))

Faculty information :
   F_name F_field
0      A      AI
1      C      BS
2      B     DLD
3      E  thermo
4      H      DS

Merged DF:
    St_id Branch  F_id F_name
0    101     IT   140      D
1    102     CS   150      E
2    104     CS   150      E
3    103    ECE   110      A
4    105   Mech   120      B

    St_id Branch  F_id F_name F_field
0    102     CS   150      E  thermo
1    104     CS   150      E  thermo
2    103    ECE   110      A      AI
3    105   Mech   120      B     DLD

##### Many-to-many join
- when the key column in both the left and right array contins dupliates

In [11]:
df_branch = pd.DataFrame({'Branch': ['CS', 'CS', 'Mech', 'ECE','ECE'], 'Subjects' : ['DAA', 'OS', 'Thermodynamics', 'DLD', 'Microprocessor']})
print("Branch Details : \n", df_branch, "\n\n Student Details: \n", df_stud)
print('\n',pd.merge(df_stud, df_branch))

Branch Details :
   Branch        Subjects
0     CS             DAA
1     CS              OS
2   Mech  Thermodynamics
3    ECE             DLD
4    ECE  Microprocessor

 Student Details:
    St_id Branch
0    101     IT
1    102     CS
2    103    ECE
3    104     CS
4    105   Mech

    St_id Branch        Subjects
0    102     CS             DAA
1    102     CS              OS
2    104     CS             DAA
3    104     CS              OS
4    103    ECE             DLD
5    103    ECE  Microprocessor
6    105   Mech  Thermodynamics

##### Specific Merges
- the 'on' keyword allows the merge to take place on specific column.
- works only if both dataframes have the specified column

In [12]:
print("Student dataframe: \n", df_stud,'\nFaculty Dataframe :\n', df_fac)
print("Merged dataframe : \n ", pd.merge(df_stud, df_fac, on = 'Branch') )

Student dataframe:
    St_id Branch
0    101     IT
1    102     CS
2    103    ECE
3    104     CS
4    105   Mech
Faculty Dataframe :
    F_id F_name Branch
0   110      A    ECE
1   120      B   Mech
2   130      C    EEE
3   140      D     IT
4   150      E     CS
Merged dataframe :
     St_id Branch  F_id F_name
0    101     IT   140      D
1    102     CS   150      E
2    104     CS   150      E
3    103    ECE   110      A
4    105   Mech   120      B

When similar columns have different names in different dataframes

In [14]:
df_fac = pd.DataFrame({'F_name' : ['A', 'B', 'C', 'D', 'E'],'Stream': ['ECE','Mech', 'EEE', "IT", 'CS'] })
print("Student Details : \n", df_stud, 'Faculty Details: \n', df_fac)
print("Merged Dataframes : \n", pd.merge(df_stud, df_fac, left_on = 'Branch', right_on = 'Stream'))

Student Details :
    St_id Branch
0    101     IT
1    102     CS
2    103    ECE
3    104     CS
4    105   Mech Faculty Details:
   F_name Stream
0      A    ECE
1      B   Mech
2      C    EEE
3      D     IT
4      E     CS
Merged Dataframes :
    St_id Branch F_name Stream
0    101     IT      D     IT
1    102     CS      E     CS
2    104     CS      E     CS
3    103    ECE      A    ECE
4    105   Mech      B   Mech

We can also drop the redundant column

In [15]:
pd.merge(df_stud, df_fac, left_on = 'Branch', right_on = 'Stream').drop('Stream', axis = 1)

   St_id Branch F_name
0    101     IT      D
1    102     CS      E
2    104     CS      E
3    103    ECE      A
4    105   Mech      B

##### Merge over indices
- left_index and right_index flags can be used to perform merge over the similar index of the dataframes.
- Also, join( ) method performs the merge by default on indices

In [19]:
df1 = df_stud.set_index('Branch')
df2 = df_fac.set_index('Stream')
print("Student Details : \n", df1, 'Faculty Details: \n', df2)
print('\nUsing merge on indices: \n',pd.merge(df1, df2, left_index=True, right_index=True))
print('\nUsing join( ): \n', df1.join(df2))

Student Details :
         St_id
Branch
IT        101
CS        102
ECE       103
CS        104
Mech      105 Faculty Details:
        F_name
Stream
ECE         A
Mech        B
EEE         C
IT          D
CS          E
Using merge on indices:
       St_id F_name
CS      102      E
CS      104      E
ECE     103      A
IT      101      D
Mech    105      B
Using join( ):
       St_id F_name
CS      102      E
CS      104      E
ECE     103      A
IT      101      D
Mech    105      B

##### Mix and match
Mix indices and columns like left_index with right_on or left_on with right_index

##### Different types of joins can also be specified like 'inner' , 'outer', 'left' and 'right' using how keyword